experiments/results/fixed_graph_padded_3seed_20260822/bench_kda_padded_N40_w16_ckpt161_recon0_measure_s42.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/fixed_graph_padded_3seed_20260822/result_kda_padded_N40_w16_ckpt161_recon0_seed42.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31007/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/fixed_graph_padded_3seed_20260822/result_kda_padded_N40_w16_ckpt161_recon0_seed42.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 234443
#Output tokens: 11776
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 184/184 [00:10<00:00, 18.33it/s]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang
Traffic request rate:                    inf
Max request concurrency:                 16
Successful requests:                     184
Benchmark duration (s):                  10.04
Total input tokens:                      234443
Total input text tokens:                 234443
Total generated tokens:                  11776
Total generated tokens (retokenized):    11372
Request throughput (req/s):              18.32
Input token throughput (tok/s):          23340.64
Output token throughput (tok/s):         1172.39
Peak output token throughput (tok/s):    1488.00
Peak concurrent requests:                48
Total token throughput (tok/s):          24513.04
Concurrency:                             15.46
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   843.75
Median E2E Latency (ms):                 807.15
P90 E2E Latency (ms):                    946.74
P95 E2E Latency (ms):                    1186.21
P99 E2E Latency (ms):                    1187.36
---------------Time to First Token----------------
Mean TTFT (ms):                          217.68
Median TTFT (ms):                        207.04
P90 TTFT (ms):                           388.13
P95 TTFT (ms):                           528.50
P99 TTFT (ms):                           620.30
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.94
Median TPOT (ms):                        9.85
P90 TPOT (ms):                           11.99
P95 TPOT (ms):                           12.14
P99 TPOT (ms):                           13.27
---------------Inter-Token Latency----------------
Mean ITL (ms):                           9.94
Median ITL (ms):                         8.17
P90 ITL (ms):                            8.49
P95 ITL (ms):                            8.71
P99 ITL (ms):                            51.21
Max ITL (ms):                            345.36
==================================================